In [1]:
import sqlite3
import pandas as pd
import numpy as np

In [2]:
conn = sqlite3.connect("/Users/dryanmiller/suicides.db")
c = conn.cursor()

In [4]:
c.execute("""SELECT * FROM suicides""")
suicides_df = pd.DataFrame(c.fetchall())

In [6]:
suicides_df.columns = [i[0] for i in c.description]

In [7]:
suicides_df.head()

,country,year,sex,age,suicides_no,population,suicides/100k pop,country-year,HDI for year,gdp_for_year ($),gdp_per_capita ($),generation
0,Albania,1987,male,15-24 years,21,312900,6.71,Albania1987,,"2,156,624,900",796,Generation X
1,Albania,1987,male,35-54 years,16,308000,5.19,Albania1987,,"2,156,624,900",796,Silent
2,Albania,1987,female,15-24 years,14,289700,4.83,Albania1987,,"2,156,624,900",796,Generation X
3,Albania,1987,male,75+ years,1,21800,4.59,Albania1987,,"2,156,624,900",796,G.I. Generation
4,Albania,1987,male,25-34 years,9,274300,3.28,Albania1987,,"2,156,624,900",796,Boomers

In [42]:
c.execute("""SELECT year, SUM(suicides_no)/(SUM(population)/100000.0) AS rate FROM suicides
            WHERE country='Albania'
            AND age='75+ years'
            GROUP BY year;""")
suicides_albania = pd.DataFrame(c.fetchall())
suicides_albania.columns = [i[0] for i in c.description]
suicides_albania.head()

   year      rate
0  1987  3.484321
1  1988  5.110733
2  1989  3.361345
3  1992  0.000000
4  1993  1.574803

In [43]:
c.execute("""SELECT year, SUM(suicides_no)/(SUM(population)/100000.0) AS rate FROM suicides
            WHERE country='United States'
            AND age='75+ years'
            GROUP BY year;
            """)
suicides_US = pd.DataFrame(c.fetchall())
suicides_US.columns = [i[0] for i in c.description]
suicides_US.head()

   year       rate
0  1985  22.916847
1  1986  24.149574
2  1987  24.952741
3  1988  24.593056
4  1989  23.064907

In [44]:
from scipy.stats import ttest_ind
ttest_ind(suicides_albania['rate'], suicides_US['rate'], equal_var=False)

Ttest_indResult(statistic=-16.816523851665554, pvalue=1.1420531581905101e-20)

In [46]:
c.execute("""SELECT name FROM sqlite_master WHERE type='table';""")
c.description

(('name', None, None, None, None, None, None),)